---
kind: other
id: Methods.T:Autodesk.Revit.DB.FabricationService
source: html/baad92db-c83b-2a65-9908-73da8f20ae91.htm
---
# FabricationService Methods

Gets the service button for a given palette index and button index from the service.